tap "datadog-labs/pack"
tap "getagentseal/codeburn"
tap "heroku/brew"
tap "peonping/tap"
# Processes triangulated solid meshes
brew "admesh"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# CloudFlare's PKI toolkit
brew "cfssl"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Independent set of GDScript tools - parser, linter, formatter, and more
brew "gdtoolkit"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Kubernetes package manager
brew "helm"
# Process manager for Procfile-based applications
brew "hivemind"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Deep clean and optimize your Mac
brew "mole"
# Nice to use pager for humans
brew "moor"
# NCurses Disk Usage
brew "ncdu"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# PNG file optimizer
brew "optipng"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Shell command parallelization utility
brew "parallel"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@16"
# Object-relational database system
brew "postgresql@17"
# Unix pager optimized for psql
brew "pspg"
# Password generator
brew "pwgen"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Command-line client for the Registration Data Access Protocol
brew "rdap"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Lightweight BitTorrent client
brew "transmission-cli"
# Parser generator tool
brew "tree-sitter-cli"
# Terminal spreadsheet multitool for discovering and arranging data
brew "visidata"
# Execute commands when watched files change
brew "watchexec"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Command-line interface for 1Password
cask "1password-cli"
# 3D creation suite
cask "blender"
# Open source IDE for exploring and testing APIs
cask "bruno"
# E-books management software
cask "calibre"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Web browser
cask "firefox"
cask "font-fira-code-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Git GUI
cask "gitx"
# 2D and 3D game engine
cask "godot"
# Adds an OpenGL renderer to the ZDoom source port
cask "gzdoom"
# Desktop automation application
cask "hammerspoon"
# File archiver
cask "keka"
# Discover, download, and run local LLMs
cask "lm-studio"
# Clipboard manager
cask "maccy"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-app"
# OpenJDK distribution from Azul
cask "zulu@17"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alfish.godot-files"
vscode "aliariff.vscode-erb-beautify"
vscode "anthropic.claude-code"
vscode "austenc.tailwind-docs"
vscode "backnotprop.prompt-tower"
vscode "bierner.markdown-mermaid"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "casualjim.gotemplate"
vscode "chdsbd.githubinator"
vscode "danielknights.vscode-mjml"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "deerawan.vscode-dash"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "equimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "geequlim.godot-tools"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hwencc.html-tag-wrapper"
vscode "jacqueslucke.blender-development"
vscode "james-ni.openshadinglanguage"
vscode "johnpapa.vscode-peacock"
vscode "johob.pico8-vscode"
vscode "kaiwood.endwise"
vscode "koichisasada.vscode-rdbg"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-speech"
vscode "okeeffdp.snowflake-vscode"
vscode "platformio.platformio-ide"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.shader"
vscode "sqlfluff.vscode-sqlfluff"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tailscale.vscode-tailscale"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "wmaurer.vscode-jumpy"
vscode "xabikos.javascriptsnippets"
vscode "zhuangtongfa.material-theme"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
krew "ctx"
krew "krew"
krew "ns"
npm "corepack"
npm "wrangler"
