tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "heroku/brew"
brew "ansible"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "cfssl"
brew "coreutils"
brew "dep"
brew "diff-so-fancy"
brew "direnv"
brew "dnsmasq", restart_service: true
brew "fd"
brew "fzf"
brew "git"
brew "gpg"
brew "graphviz"
brew "grc"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "macvim", args: ["with-override-system-vim"]
brew "ncdu"
brew "neovim"
brew "nmap"
brew "p7zip"
brew "parallel"
brew "pgcli"
brew "prettyping"
brew "pwgen"
brew "qcachegrind", args: ["with-graphviz"]
brew "qt@5.5"
brew "ripgrep"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "goreleaser/tap/goreleaser"
cask "atom"
cask "blender"
cask "calibre"
cask "dash"
cask "firefox"
cask "firefox-developer-edition"
cask "font-hack"
cask "font-source-code-pro"
cask "heroku"
cask "google-cloud-sdk"
cask "keepingyouawake"
cask "ngrok"
cask "sketch"
cask "transmission"
cask "transmit"
cask "vagrant"
cask "viscosity"
cask "visual-studio-code"
cask "wireshark"
